app/controllers/articles_controller.rb

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
DELETE FROM "articles" WHERE "articles"."id" = ?  [["id", 14]]
---
    def destroy
        @article = Article.find(params[:id])
        flash.notice = "Article '#{@article.title}' Destroyed!"
        @article.destroy