app/controllers/comments_controller.rb

INSERT INTO "comments" ("author_name", "body", "article_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["author_name", "asd"], ["body", "blah"], ["article_id", 13], ["created_at", "2019-08-06 06:30:45.329077"], ["updated_at", "2019-08-06 06:30:45.329077"]]
---
def create
    @comment = Comment.new(comment_parms)
    @comment.article_id = params[:article_id]

    @comment.save